package basic_part1;

/*
9. Напишите программу на Java для вычисления указанных выражений и вывода результатов.
Тестовые данные:
((25,5*3,5 – 3,5*3,5)/(40,5 – 4,5))
Ожидаемый результат
2.138888888888889
 */

public class Task9 {
    public static void main(String[] args) {
        System.out.println(((25.5 * 3.5 - 3.5 * 3.5) / (40.5 - 4.5)));
    }
}
